Repository: WoeUSB/WoeUSB
Catalog: share/locale/*/LC_MESSAGES/woeusb.po
Languages: pt_br, zh_cn, zh_tw

source: Unable to mount source filesystem in %s\n
pt_br: Não foi possível montar o sistema de arquivos de origem em %s\n
zh_cn: 无法挂载位于 %s 的来源文件系统\n
zh_tw: 無法掛載位於 %s 的來源檔案系統\n

source: Unable to mount target filesystem in %s\n
pt_br: Não foi possível montar o sistema de arquivos de destino em %s\n
zh_cn: 无法挂载位于 %s 的目标文件系统\n
zh_tw: 無法掛載位於 %s 的目標檔案系統\n

source: Done :)\n
pt_br: Feito :)\n
zh_cn: 完成了 :)\n
zh_tw: 完成了 :)\n

source: The target device should be bootable now\n
pt_br: O dispositivo de destino deve ser inicializável agora\n
zh_cn: 目标设备现在应能正常开机\n
zh_tw: 目標裝置現在應能正常開機\n

source: %s: Error: The setext_separator_max_length parameter can only be used with the Setext heading style.\n
pt_br: %s: Erro: O parâmetro setext_separator_max_length só pode ser usado com o estilo de cabeçalho Setext.\n
zh_cn: %s：错误：setext_separator_max_length 参数只能用于 Setext Markdown 标题风格。\n
zh_tw: %s：錯誤：setext_separator_max_length 參數只能用於 Setext Markdown 標題風格。\n

source: %s: Error: Atx heading style only support at most level 6, got %s\n
pt_br: %s: Erro: O estilo de cabeçalho Atx suporta no máximo nível 6, mas recebeu %s\n
zh_cn: %s：错误：Atx Markdown 标题风格最多只支持第六级，但拿到了 %s\n
zh_tw: %s：錯誤：Atx Markdown 標題風格最多只支援第六級，但拿到了 %s\n

source: %s: Error: Setext heading style only support at most level 2, got %s\n
pt_br: %s: Erro: O estilo de cabeçalho Setext suporta no máximo nível 2, mas recebeu %s\n
zh_cn: %s：错误：Setext Markdown 标题风格最多只支持第二级标题，但拿到了 %s\n
zh_tw: %s：錯誤：Setext Markdown 標題風格最多只支援第二級標題，但拿到了 %s\n

source: %s: Error: The setext_separator_max_length parameter only accepts numbers and 'terminal' as argument, but got "%s".\n
pt_br: %s: Erro: O parâmetro setext_separator_max_length só aceita números e 'terminal' como argumento, mas recebeu "%s".\n
zh_cn: %s：错误：setext_separator_max_length 参数只支持数字以及 'terminal' 作为引数，但是拿到了「%s」。\n
zh_tw: %s：錯誤：setext_separator_max_length 參數只支援數字以及 'terminal' 作為引數，但是拿到了「%s」。\n

source: %s: Error: Unsupported markdown heading style "%s".\n
pt_br: %s: Erro: Sem suporte ao estilo de cabeçalho de marcação "%s".\n
zh_cn: %s：错误：不支持的「%s」Markdown 标题风格。\n
zh_tw: %s：錯誤：不支援的「%s」Markdown 標題風格。\n

source: %s %s Help Information
pt_br: Informações de ajuda do %s %s
zh_cn: %s %s 的帮助说明
zh_tw: %s %s 的幫助說明

source: %s can create a bootable Microsoft Windows(R) USB storage device from an existing Windows optical disk or an ISO disk image.
pt_br: %s pode criar um dispositivo USB de armazenamento inicializável do Microsoft Windows(R) a partir de um existente disco óptico do Windows ou de uma imagem ISO.
zh_cn: %s 可以自现有的 Windows 光盘或 ISO 光盘映像档创建可启动的 Microsoft Windows(R) USB 保存设备。
zh_tw: %s 可以自現有的 Windows 光碟或 ISO 光碟映像檔創建可啟動的 Microsoft Windows(R) USB 儲存設備。

source: Supported installation drive preparation modes
pt_br: Modos suportados de preparação de unidade de instalação
zh_cn: 支持的安装驱动器准备模式
zh_tw: 支援的安裝驅動器準備模式

source: Currently two creation methods are supported:
pt_br: Atualmente, há suporte a dois métodos de criação:
zh_cn: 目前支持两种创建方法：
zh_tw: 目前支援兩種創建方法：

source: Completely WIPE the entire USB storage device, then build a bootable Windows USB device from scratch.
pt_br: APAGA completamente todo o dispositivo de armazenamento USB e cria um dispositivo USB inicializável do Windows a partir do zero.
zh_cn: 完全抹除整个 USB 保存设备，然后从头开始建构可开机的 Windows USB 设备。
zh_tw: 完全抹除整個 USB 儲存裝置，然後從頭開始建構可開機的 Windows USB 裝置。

source: WARNING: All previous data on the device will be gone!
pt_br: AVISO: Todos os dados anteriores do dispositivo desaparecerão!
zh_cn: 警告：所有设备上的既有数据都将丢失！
zh_tw: 警告：所有設備上的既有資料都將丟失！

source: Copy Windows files to an existing partition of a USB storage device and make it bootable. This allows files to coexist as long as no filename conflict exists.
pt_br: Copia os arquivos do Windows para uma partição existente de um dispositivo de armazenamento USB e torna-o inicializável. Isso permite que os arquivos coexistam, desde que não haja conflito de nome de arquivo.
zh_cn: 拷贝 Windows 安装文档至 USB 保存设备的既有分区中并使其可开机。这将能够在没有文件名冲突的前提下让文件能够共存。
zh_tw: 複製 Windows 安裝文件至 USB 儲存裝置的既有分區中並使其可開機。這將能夠在沒有檔名衝突的前提下讓檔案能夠共存。

source: WARNING: All files that has the same name will be overwritten!
pt_br: AVISO: Todos os arquivos com o mesmo nome serão substituídos!
zh_cn: 警告：所有包含相同名称的文件将被覆写！
zh_tw: 警告：所有包含相同名稱的檔案將被覆寫！

source: Command-line Options
pt_br: Opções de linha de comando
zh_cn: 命令行选项
zh_tw: 命令列選項

source: Verbose mode
pt_br: Modo verboso
zh_cn: 冗余输出模式
zh_tw: 冗餘輸出模式

source: Show this help message and exit
pt_br: Mostra esta mensagem de ajuda e sai
zh_cn: 显示此帮助消息并且离开
zh_tw: 顯示此幫助訊息並且離開

source: Print application version
pt_br: Imprime a versão do aplicativo
zh_cn: 印出应用软件的版本
zh_tw: 印出應用軟體的版本

source: Show info about this application
pt_br: Mostra informações sobre este aplicativo
zh_cn: 显示关于本应用软件的相关信息
zh_tw: 顯示關於本應用軟體的相關資訊

source: Disable message coloring
pt_br: Desativa cores de mensagens
zh_cn: 禁用消息上色
zh_tw: 禁用訊息上色

source: Enable script debugging
pt_br: Ativa depuração do script
zh_cn: 激活脚本调试功能
zh_tw: 啟用腳本除錯功能

source: Specify label for the newly created file system in --device creation method
pt_br: Especifica um rótulo para o sistema de arquivos recém-criado no método de criação --device
zh_cn: 指定于 --device 建构模式中新创建之文件系统的文本标签
zh_tw: 指定於 --device 建構模式中新建立之檔案系統的文字標籤

source: Note that the label is not verified for validity and may be illegal for the filesystem
pt_br: Observe que o rótulo não é verificado quanto à validade e pode ser ilegal para o sistema de arquivos
zh_cn: 注意：提供的文本标签并不会验证有效性，且可能是指定文件系统的无效标签
zh_tw: 注意：提供的文字標籤並不會驗證有效性，且可能是指定檔案系統的無效標籤

source: Workaround BIOS bug that won't include the device in boot menu if non of the partition's boot flag is toggled
pt_br: Contorna bug da BIOS que não inclui o dispositivo no menu de inicialização se nenhum sinalizador de inicialização da partição estiver habilitado
zh_cn: 回避当分区的 boot 旗标没有激活时设备不会被列在开机菜单中的 BIOS 固件缺陷
zh_tw: 迴避當分區的 boot 旗標沒有啟用時裝置不會被列在開機選單中的 BIOS 韌體缺陷

source: Development option for developers to test certain function without running the entire build
zh_cn: 开发者用来在不用运行完整的制作进程下测试特定函数功能的开发功能选项\n

source: Specify the filesystem to use as the target partition's filesystem.
pt_br: Especifica o sistema de arquivos a ser usado como o sistema de arquivos da partição de destino.
zh_cn: 指定要作为目标分区之文件系统的文件系统。
zh_tw: 指定要作為目標分區之檔案系統的檔案系統。

source: Currently supported: FAT(default)/NTFS
pt_br: Atualmente suportado: FAT (padrão)/NTFS
zh_cn: 目前支持：FAT（默认值）/ NTFS
zh_tw: 目前支援：FAT（預設值）/ NTFS

source: No longer supported, reserved for compatibility with the wrapper programs
pt_br: Não é mais suportado, reservado para compatibilidade com os programas wrapper
zh_cn: 不再被支持，仅用于兼容 WoeUSB 的包装程序
zh_tw: 不再被支援，僅用於相容 WoeUSB 的包裝程式

source: --partition option requires 2 arguments!\n
zh_cn: --partition 命令选项需要 2 个参数！\n
zh_tw: --partition 命令選項需要 2 個引數！\n

source: --device option requires 2 arguments!\n
zh_cn: --device 命令选项需要 2 个参数！\n
zh_tw: --device 命令選項需要 2 個引數！\n

source: --label option requires 1 argument.\n
zh_cn: --label 命令选项需要 1 个参数。\n
zh_tw: --label 命令選項需要 1 個引數。\n

source: --debugging-internal-function-call option requires at least 1 argument.\n
zh_cn: --debugging-internal-function-call 命令选项需要至少 1 个参数。\n
zh_tw: --debugging-internal-function-call 命令選項需要至少 1 個引數。\n

source: --target-filesystem option requires 1 argument.\n
zh_cn: --target-filesystem option 需要至少 1 个参数。\n
zh_tw: --target-filesystem option 需要至少 1 個引數。\n

source: Unknown command-line argument "%s"\n
pt_br: Argumento de linha de comando desconhecido "%s"\n
zh_cn: 未知的「%s」命令行参数\n
zh_tw: 未知的「%s」命令列引數\n

source: No creation method specified!\n
pt_br: Nenhum método de criação especificado!\n
zh_cn: 未指定任何 Windows 安装碟制作模式！\n
zh_tw: 未指定任何 Windows 安裝碟製作模式！\n

source: --device and --partition creation method are mutual-exclusive.\n
zh_cn: --device 跟 --partition Windows 安装碟创建模式是互斥的。\n
zh_tw: --device 跟 --partition Windows 安裝碟創建模式是互斥的。\n

source: --label option only can be used with --device creation method\n
zh_cn: --label 命令选项仅能与 --device Windows 安装碟创建方式一起使用\n
zh_tw: --label 命令選項僅能與 --device Windows 安裝碟創建方式一起使用\n

source: --target-filesystem option only can be used with --device creation method\n
zh_cn: --target-filesystem 命令选项仅能与 --device 安装碟创建方式一起使用\n
zh_tw: --target-filesystem 命令選項僅能與 --device 安裝碟創建方式一起使用\n

source: Target filesystem not supported.\n
pt_br: Sistema de arquivos de destino incompatível.\n
zh_cn: 目标文件系统不被支持。\n
zh_tw: 目標檔案系統不被支援。\n

source: %s requires %s command in the executable search path, but it is not found.\n
zh_cn: %s 需要 %s 命令在可运行档搜索路径中，但是找不到。\n
zh_tw: %s 需要 %s 命令在可執行檔搜尋路徑中，但是找不到。\n

source: mkdosfs/mkfs.msdos/mkfs.vfat/mkfs.fat command not found!\n
pt_br: Comando mkdosfs/mkfs.msdos/mkfs.vfat/mkfs.fat não encontrado!\n
zh_cn: mkdosfs/mkfs.msdos/mkfs.vfat/mkfs.fat 命令找不到！\n
zh_tw: mkdosfs/mkfs.msdos/mkfs.vfat/mkfs.fat 命令找不到！\n

source: Please make sure that dosfstools is properly installed!\n
pt_br: Certifique-se de que o dosfstools esteja instalado corretamente!\n
zh_cn: 请确保 dosfstools 依赖软件已正确安装！\n
zh_tw: 請確保 dosfstools 依賴軟體已正確安裝！\n

source: mkntfs command not found!\n
pt_br: Comando mkntfs não encontrado!\n
zh_cn: 找不到 mkntfs 命令！\n
zh_tw: 找不到 mkntfs 命令！\n

source: Please make sure that ntfs-3g is properly installed!\n
pt_br: Certifique-se de que o ntfs-3g esteja instalado corretamente!\n
zh_cn: 请确保 ntfs-3g 软件已正确安装！\n
zh_tw: 請確保 ntfs-3g 軟體已正確安裝！\n

source: grub-install or grub2-install command not found!\n
pt_br: Comando grub-install ou grub2-install não encontrado!\n
zh_cn: grub-install 或 grub2-install 命令找不到！\n
zh_tw: grub-install 或 grub2-install 命令找不到！\n

source: Please make sure that GNU GRUB is properly installed!\n
pt_br: Certifique-se de que o GNU GRUB esteja instalado corretamente!\n
zh_cn: 请确保 GNU GRUB 软件已正确安装！\n
zh_tw: 請確保 GNU GRUB 軟體已正確安裝！\n

source: You are not running %s as the superuser(root)!\n
pt_br: Você não está executando %s como superusuário(root)!\n
zh_cn: 您没有以 superuser(root) 身份运行 %s！\n
zh_tw: 您沒有以 superuser(root) 身份運行 %s！\n

source: This might be the reason of the following failure.\n
pt_br: Este pode ser o motivo da seguinte falha.\n
zh_cn: 这可能是接下来的运行失败的造成原因。\n
zh_tw: 這可能是接下來的執行失敗的造成原因。\n

source: source media "%s" not found or not a regular file or a block device file!\n
pt_br: Mídia de origem "%s" não encontrada ou não é um arquivo regular ou um arquivo de dispositivo de bloco!\n
zh_cn: 「%s」来源媒体找不到或是不是一个一般的文件或区块设备！\n
zh_tw: 「%s」來源媒體找不到或是不是一個一般的檔案或區塊裝置！\n

source: Target media "%s" is not a block device file!\n
pt_br: A mídia de destino "%s" não é um arquivo de dispositivo de bloco!\n
zh_cn: 「%s」目标媒体不是一个区块设备！\n
zh_tw: 「%s」目標媒體不是一個區塊裝置！\n

source: Target media "%s" is not an entire storage device!\n
pt_br: A mídia de destino "%s" não é um dispositivo de armazenamento inteiro!\n
zh_cn: 「%s」目标媒体不是一个完整区块设备！\n
zh_tw: 「%s」目標媒體不是一個完整區塊裝置！\n

source: Target media "%s" is not an partition!\n
pt_br: A mídia de destino "%s" não é uma partição!\n
zh_cn: 「%s」目标媒体不是一个分区！\n
zh_tw: 「%s」目標媒體不是一個分區！\n

source: Unsupported target filesystem "%s", currently supported target filesystems: %s, %s\n
pt_br: Sistema de arquivos de destino não suportado "%s", sistemas de arquivos de destino atualmente suportados: %s, %s\n
zh_cn: 不支持的「%s」目标文件系统，目前支持的目标文件系统有：%s、%s\n
zh_tw: 不支援的「%s」目標檔案系統，目前支援的目標檔案系統有：%s、%s\n

source: Target device is '%s'.\n
pt_br: O dispositivo de destino é "%s".\n
zh_cn: 目标设备是「%s」。\n
zh_tw: 目標裝置是「%s」。\n

source: Target partition is '%s'.\n
pt_br: A partição de destino é "%s".\n
zh_cn: 目标分区是「%s」。\n
zh_tw: 目標分區是「%s」。\n

source: Target filesystem is '%s'.\n
pt_br: O sistema de arquivos de destino é "%s".\n
zh_cn: 目标文件系统是「%s」。\n
zh_tw: 目標檔案系統是「%s」。\n

source: Source media is currently mounted, unmount the partition then try again\n
pt_br: A mídia de origem está montada no momento, desmonte a partição e tente novamente\n
zh_cn: 来源媒体的文件系统目前正在被挂载，将该分区解挂载后再试一次\n
zh_tw: 來源媒體的檔案系統目前正在被掛載，將該分區解掛載後再試一次\n

source: Target partition is currently mounted, unmount the partition then try again\n
pt_br: A partição de destino está montada no momento, desmonte a partição e tente novamente\n
zh_cn: 目标分区的文件系统目前已被挂载，将其解挂载后再试一次\n
zh_tw: 目標分區的檔案系統目前已被掛載，將其解掛載後再試一次\n

source: Target device is currently busy, unmount all mounted partitions in target device then try again\n
pt_br: O dispositivo de destino está ocupado no momento, desmonte todas as partições montadas no dispositivo de destino e tente novamente\n
zh_cn: 目标设备目前忙碌中，将该设备所有已挂载分区解挂载后再试一次\n
zh_tw: 目標裝置目前忙碌中，將該裝置所有已掛載分區解掛載後再試一次\n

source: Wiping all existing partition table and filesystem signatures in %s...\n
pt_br: Apagando todas as tabelas de partições existentes e assinaturas do sistema de arquivos em %s...\n
zh_cn: 正在抹除 %s 中所有既有的分区表与文件系统痕迹……\n
zh_tw: 正在抹除 %s 中所有既有的分區表與檔案系統痕跡……\n

source: Ensure that %s is really wiped...\n
pt_br: Certifique-se de que %s foi realmente apagado...\n
zh_cn: 确保 %s 真的有被抹除……\n
zh_tw: 確保 %s 真的有被抹除……\n

source: Partition is still detected after wiping all signatures, this indicates that the drive might be locked into readonly mode due to end of lifespan.\n
pt_br: A partição ainda é detectada após ter apagado todas as assinaturas, isso indica que a unidade pode estar bloqueada no modo somente leitura devido ao fim da vida útil.\n
zh_cn: 在抹除所有分区表与文件系统痕迹后仍侦测到分区的存在，这代表着该存储设备可能因为寿命终结被锁定在唯读模式。\n
zh_tw: 在抹除所有分區表與檔案系統痕跡後仍偵測到分區的存在，這代表著該存儲裝置可能因為壽命終結被鎖定在唯讀模式。\n

source: Creating new partition table on %s...\n
pt_br: Criando nova tabela de partições em %s...\n
zh_cn: 正在 %s 上创建新的分区表……\n
zh_tw: 正在 %s 上建立新的分區表……\n

source: Currently GUID partition table is not supported.\n
pt_br: Atualmente, a tabela de partições GUID não é suportada.\n
zh_cn: 目前尚不支持 GUID 磁盘分区表。\n
zh_tw: 目前尚不支援 GUID 磁碟分區表。\n

source: Partition table not supported.\n
pt_br: Tabela de partição não suportada.\n
zh_cn: 分区表不被支持。\n
zh_tw: 分區表不被支援。\n

source: Making system realize that partition table has changed...\n
pt_br: Fazendo o sistema perceber que a tabela de partições foi alterada...\n
zh_cn: 正在让系统发现分区表已异动……\n
zh_tw: 正在讓系統發現分區表已異動……\n

source: Wait 3 seconds for block device nodes to populate...\n
pt_br: Aguarde 3 segundos para que os nós do dispositivo de bloco sejam preenchidos...\n
zh_cn: 等 3 秒让操作系统重新创建区块设备节点……\n
zh_tw: 等 3 秒讓作業系統重新建立區塊裝置節點……\n

source: Filesystem not supported\n
pt_br: Sistema de arquivos não suportado\n
zh_cn: 文件系统不被支持\n
zh_tw: 檔案系統不被支援\n

source: Creating target partition...\n
pt_br: Criando partição de destino...\n
zh_cn: 正在创建目标分区……\n
zh_tw: 正在建立目標分區……\n

source: Illegal parted_mkpart_fs_type, please report bug.\n
pt_br: Parted_mkpart_fs_type ilegal. Por favor, relate este bug.\n
zh_cn: 无效的 parted_mkpart_fs_type，请回报软件缺陷。\n
zh_tw: 無效的 parted_mkpart_fs_type，請回報軟體缺陷。\n

source: Applying workaround for buggy motherboards that will ignore disks with no partitions with the boot flag toggled\n
pt_br: Aplicando solução de contorno para placas-mãe com bugs que irão ignorar discos sem partições com o sinalizador de inicialização alternado\n
zh_cn: 正在套用无视不包含 boot 旗标之分区的磁盘的有问题的主板固件的问题回避措施\n
zh_tw: 正在套用無視不包含 boot 旗標之分區的磁碟的有問題的主板韌體的問題迴避措施\n

source: Target filesystem not supported, currently supported filesystem: FAT, NTFS.\n
pt_br: Sistema de arquivos de destino não suportado, sistema de arquivos atualmente suportado: FAT, NTFS.\n
zh_cn: 目标文件系统不被支持，目前支持的文件系统：FAT、NTFS。\n
zh_tw: 目標檔案系統不被支援，目前支援的檔案系統：FAT、NTFS。\n

source: Your device doesn't seems to have an UEFI:NTFS partition, UEFI booting will fail if the motherboard firmware itself doesn't support NTFS filesystem!\n
pt_br: Seu dispositivo não parece ter uma partição UEFI:NTFS, a inicialização UEFI falhará se o próprio firmware da placa-mãe não suportar o sistema de arquivos NTFS!\n
zh_cn: 您的设备似乎没有 UEFI:NTFS 支持分区，如果主版固件本身不支持 NTFS 文件系统的话 UEFI 开机将会失败！\n
zh_tw: 您的裝置似乎沒有 UEFI:NTFS 支援分區，如果主版韌體本身不支援 NTFS 檔案系統的話 UEFI 開機將會失敗！\n

source: You may recreate disk with an UEFI:NTFS partition by using the --device creation method\n
pt_br: Você pode recriar o disco com uma partição UEFI:NTFS usando o método de criação --device\n
zh_cn: 您可以使用 --device 安装碟创建方式重建一个具备 UEFI:NTFS 辅助分区的磁盘\n
zh_tw: 您可以使用 --device 安裝碟創建方式重建一個具備 UEFI:NTFS 輔助分區的磁碟\n

source: Mounting source filesystem...\n
pt_br: Montando o sistema de arquivos de origem...\n
zh_cn: 正在挂载来源文件系统……\n
zh_tw: 正在掛載來源檔案系統……\n

source: Mounting target filesystem...\n
pt_br: Montando o sistema de arquivos de destino...\n
zh_cn: 正在挂载目标文件系统……\n
zh_tw: 正在掛載目標檔案系統……\n

source: Unsupported target_fs_type, please report bug.\n
pt_br: target_fs_type não suportado. Por favor, relate este bug.\n
zh_cn: 不支持的 target_fs_type，请回报软件缺陷。\n
zh_tw: 不支援的 target_fs_type，請回報軟體缺陷。\n

source: Not enough free space on target partition!\n
pt_br: Não há espaço livre suficiente na partição de destino!\n
zh_cn: 在目标分区中没有足够的可用空间！\n
zh_tw: 在目標分區中沒有足夠的可用空間！\n

source: We required %s(%u bytes) but '%s' only has %s(%u bytes).\n
pt_br: Precisamos %s(%u bytes), mas '%s' tem apenas %s(%u bytes).\n
zh_cn: 我们需要 %s（%u 字节）但是「%s」只有 %s（%u 字节）。\n
zh_tw: 我們需要 %s（%u 位元組）但是「%s」只有 %s（%u 位元組）。\n

source: Copying files from source media...\n
pt_br: Copiando arquivos da mídia de origem...\n
zh_cn: 正在自来源媒体拷贝文件……\n
zh_tw: 正在自來源媒體複製檔案……\n

source: Copying "%s"...\n
pt_br: Copiando "%s"...\n
zh_cn: 正在拷贝「%s」……\n
zh_tw: 正在複製「%s」……\n

source: Unsupported oversized file "%s" detected, this file will NOT be transferred.\n
pt_br: Arquivo superdimensionado não suportado "%s" detectado, este arquivo NÃO será transferido.\n
zh_cn: 侦测到不支持的「%s」过大文件，这个文件将**不会**被传输。\n
zh_tw: 偵測到不支援的「%s」過大檔案，這個檔案將**不會**被傳輸。\n

source: Unknown type of '%s'!\n
pt_br: Tipo desconhecido de '%s'!\n
zh_cn: 未知的「%s」文件类型！\n
zh_tw: 未知的「%s」檔案類型！\n

source: Source media seems to be Windows 7-based with EFI support, applying workaround to make it support UEFI booting\n
pt_br: A mídia de origem parece ser baseada no Windows 7 com suporte EFI, aplicando uma solução de contorno para torná-la compatível com a inicialização UEFI\n
zh_cn: 来源媒体似乎是有 EFI 开机支持的，基于 Windows 7 的安装媒体，正在套用问题回避措施来让它能够支持 UEFI 开机\n
zh_tw: 來源媒體似乎是有 EFI 開機支援的，基於 Windows 7 的安裝媒體，正在套用問題迴避措施來讓它能夠支援 UEFI 開機\n

source: '7z' utility not found, workaround is not applied.\n
pt_br: Utilitário '7z' não encontrado, solução alternativa não aplicada.\n
zh_cn: 找不到「7z」工具程序，问题回避措施将不会被套用。\n
zh_tw: 找不到「7z」工具程式，問題迴避措施將不會被套用。\n

source: %s detected.\n
pt_br: %s detectado.\n
zh_cn: 侦测到 %s。\n
zh_tw: 偵測到 %s。\n

source: Can't find efi/boot directory, use %s.\n
pt_br: Não foi possível encontrar o diretório efi/boot, use %s.\n
zh_cn: 无法找到 efi/boot 目录，将使用 %s。\n
zh_tw: 無法找到 efi/boot 目錄，將使用 %s。\n

source: Detected existing EFI bootloader, workaround skipped.\n
pt_br: Detectado gerenciador de inicialização EFI existente, solução de contorno ignorada.\n
zh_cn: 侦测到既有的 EFI 开机程序，问题回避措施将被跳过。\n
zh_tw: 偵測到既有的 EFI 開機程式，問題迴避措施將被跳過。\n

source: Installing GRUB bootloader for legacy PC booting support...\n
pt_br: Instalando o gerenciador de inicialização GRUB para suporte de inicialização de PC legado...\n
zh_cn: 正在安装用于旧式 PC 开机支持的 GRUB 开机引导程序……\n
zh_tw: 正在安裝用於舊式 PC 開機支援的 GRUB 開機載入程式……\n

source: Installing custom GRUB config for legacy PC booting...\n
pt_br: Instalando a configuração personalizada do GRUB para inicialização legada do PC...\n
zh_cn: 正在安装用于旧式 PC 开机的自订 GRUB 配置文档……\n
zh_tw: 正在安裝用於舊式 PC 開機的自訂 GRUB 配置文件……\n

source: Unmounting and removing "%s"...\n
pt_br: Desmontando e removendo "%s"...\n
zh_cn: 正在解除挂载并移除「%s」……\n
zh_tw: 正在解除掛載並移除「%s」……\n

source: Unable to unmount "%s".\n
pt_br: Não foi possível desmontar "%s".\n
zh_cn: 无法解除挂载「%s」。\n
zh_tw: 無法解除掛載「%s」。\n

source: Unable to remove "%s".\n
pt_br: Não foi possível remover "%s".\n
zh_cn: 无法移除「%s」。\n
zh_tw: 無法移除「%s」。\n

source: The command "%s" failed with exit status "%u", program is prematurely aborted\n
pt_br: O comando "%s" falhou com o status de saída "%u", o programa foi abortado prematuramente\n
zh_cn: 「%s」命令以「%u」结束状态码失败，程序被提前中止\n
zh_tw: 「%s」命令以「%u」結束狀態碼失敗，程式被提前中止\n

source: Some mountpoints are not unmount/cleaned successfully and must be done manually\n
pt_br: Alguns pontos de montagem não foram desmontados/limpos com sucesso e devem ser feitos manualmente\n
zh_cn: 某些文件系统挂载点没有被成功地解除挂载／清理，必须手动完成。\n
zh_tw: 某些檔案系統掛載點沒有被成功地解除掛載／清理，必須手動完成。\n

source: We unable to unmount target filesystem for you, please make sure target filesystem is unmounted before detaching to prevent data corruption\n
pt_br: Não foi possível desmontar o sistema de arquivos de destino para você, certifique-se de que o sistema de arquivos de destino esteja desmontado antes de desconectar para evitar corrupção de dados\n
zh_cn: 我们无法为您解除挂载目标文件系统，为避免发生数据毁损请在解除连接设备前确保目标文件系统已解除挂载\n
zh_tw: 我們無法為您解除掛載目標檔案系統，為避免發生資料毀損請在解除連接裝置前確保目標檔案系統已解除掛載\n

source: Target device is busy, please make sure you unmount all filesystems on target device or shutdown the computer before detaching it.\n
pt_br: O dispositivo de destino está ocupado, certifique-se de desmontar todos os sistemas de arquivos no dispositivo de destino ou desligar o computador antes de removê-lo.\n
zh_cn: 目标设备忙碌中，在将其解除连接前请确保您已解除挂载所有目标设备的文件系统或是将电脑关机。\n
zh_tw: 目標裝置忙碌中，在將其解除連接前請確保您已解除掛載所有目標裝置的檔案系統或是將電腦關機。\n

source: You may now safely detach the target device\n
pt_br: Agora você pode desconectar com segurança o dispositivo de destino\n
zh_cn: 您现在可以安全地解除连接目标设备\n
zh_tw: 您現在可以安全地解除連接目標裝置\n

source: Recieved SIGINT, program is interrupted.\n
pt_br: SIGINT recebido, programa interrompido.\n
zh_cn: 接收到 SIGINT 信号，程序被中止。\n
zh_tw: 接收到 SIGINT 訊號，程式被中止。\n

source: returning from %s\n
pt_br: retornando de %s\n
zh_cn: 自 %s 返回\n
zh_tw: 自 %s 返回\n

source: Error occurred while running command "%s" (exit status: %u)!\n
pt_br: Ocorreu um erro ao executar o comando "%s" (status de saída: %u)!\n
zh_cn: 在运行「%s」命令时发生错误（结束状态码：%u）！\n
zh_tw: 在運行「%s」命令時發生錯誤（結束狀態碼：%u）！\n

source: Press ENTER to continue\n
pt_br: Pressione ENTER para continuar\n
zh_cn: 请按 ENTER 键继续\n
zh_tw: 請按 ENTER 鍵繼續\n

source: Illegal parameter, please report bug.\n
pt_br: Parâmetro ilegal. Por favor, relate este bug.\n
zh_cn: 无效的参数，请回报软件缺陷。\n
zh_tw: 無效的參數，請回報軟體缺陷。\n

source: Parameter quantity illegal, please report bug.\n
pt_br: Quantidade de parâmetro ilegal. Por favor, relate este bug.\n
zh_cn: 函数参数数量无效，请回报软件缺陷。\n
zh_tw: 函式參數數量無效，請回報軟體缺陷。\n

source: %s: FATAL: This function should have at least 1 argument.\n
pt_br: %s: FATAL: Esta função deve ter pelo menos 1 argumento.\n
zh_cn: %s：致命错误：此函数应制少有一个参数。\n
zh_tw: %s：致命錯誤：此函式應制少有一個引數。\n

source: %s: FATAL:
zh_cn: %s：致命错误：
zh_tw: %s：致命錯誤：

source: This function should have at least 1 argument.\n
pt_br: Esta função deve ter pelo menos 1 argumento.\n
zh_cn: 此函数应至少有 1 个参数。\n
zh_tw: 此函式應至少有 1 個引數。\n

source: Info:
zh_cn: 信息：
zh_tw: 資訊：

source: Warning:
pt_br: Aviso:
zh_cn: 警告：
zh_tw: 警告：

source: ERROR:
pt_br: ERRO:
zh_cn: 错误：
zh_tw: 錯誤：

source: %s: DEBUG:
zh_cn: %s：调试：
zh_tw: %s：除錯：

source: array is empty!\n
pt_br: o array está vazio!\n
zh_cn: 数组是空的！\n
zh_tw: 陣列是空的！\n

source: Function %s requires %u parameters, but %u is given\n
pt_br: A função %s requer %u parâmetros, mas %u foi fornecido\n
zh_cn: %s 函数需要 %u 个参数，但是只拿到了 %u 个\n
zh_tw: %s 函式需要 %u 個引數，但是只拿到了 %u 個\n

source: This program requires Bash >= 4.3 to function properly, refer <%s> for more info.\n
pt_br: Este programa requer Bash >= 4.3 para funcionar corretamente, consulte <%s> para mais informações.\n
zh_cn: 本程序需要 >= 4.3 版的 Bash 才能正常运作，参阅 <%s> 查看更多信息。\n
zh_tw: 本程式需要 >= 4.3 版的 Bash 才能正常運作，參閱 <%s> 查看更多資訊。\n

source: This program requires GNU Coreutils in the executable search path
pt_br: Este programa requer GNU Coreutils no caminho de pesquisa executável
zh_cn: 本进程需要 GNU Coreutils 在可运行档搜索路径中
zh_tw: 本程序需要 GNU Coreutils 在可執行檔搜尋路徑中

source: Development option for developers to test certain function without running the entire build\n
pt_br: Opção de desenvolvimento para desenvolvedores testarem determinada função sem executar a compilação inteira\n
zh_tw: 開發者用來在不用運行完整的製作程序下測試特定函式功能的開發功能選項\n
